const db = require('../models')

module.exports = function () {
  return Promise.resolve()

  // Categories
    .then(() => {
      db.Img.create({
        img_id: 1,
        name: 'sport_header',
        file_name: 'sport_header',
        file_path: '/static_img/category/'
      })
    })
    .then(() => {
      db.Img.create({
        img_id: 2,
        name: 'sport_preview',
        file_name: 'sport_preview',
        file_path: '/static_img/category/'
      })
    })
    .then(() => {
      db.Img.create({
        img_id: 3,
        name: 'travel_header',
        file_name: 'travel_header',
        file_path: '/static_img/category/'
      })
    })
    .then(() => {
      db.Img.create({
        img_id: 4,
        name: 'travel_preview',
        file_name: 'travel_preview',
        file_path: '/static_img/category/'
      })
    })
    .then(() => {
      db.Img.create({
        img_id: 5,
        name: 'programing_header',
        file_name: 'programing_header',
        file_path: '/static_img/category/'
      })
    })
    .then(() => {
      db.Img.create({
        img_id: 6,
        name: 'programing_preview',
        file_name: 'programing_preview',
        file_path: '/static_img/category/'
      })
    })
    .then(() => {
      db.Category.create({
        category_id: 1,
        name: 'sport',
        title: 'Спортивный раздел',
        discription: 'Различные статьи и материалы на спортивную тематику',
        content: 'Случайностей не бывает, и если вы здесь, то вы или велосипедист, или путешественник, или сочувствующий. Мне хотелось бы заинтересовать вас своим сайтом. Я сделал небольшую подборку материала, который может быть полезен как для начинающих велосипедистов, так и для тех, кто решил выехать на велосипеде в дальнюю дорогу.',
        header_img_id: 1,
        previwe_img_id: 2
      })
    })
    .then(() => {
      db.Category.create({
        category_id: 2,
        name: 'travel',
        title: 'Путешествия',
        discription: 'Путешествия и все что с ними связано',
        content: 'Блоги о путешествиях, которые вы обязательно должны знать. Многим может показаться, что в жж уже ничего интересного на тему Блоги о путешествиях не найти, но, судя по этой подборке мы многого и многих не знаем. Фотограф составил список своих «открытий-блогеров».  Не удивляйтесь большому количество фотографов в этом списке, которые увлекаются подводной съемкой. Это не случайно. Сам Михаил тоже увлекается подобным и недавно вы о нем опубликовали статью, как он крокодилов снимал (вдруг, вам будет интересно почитать)',
        header_img_id: 3,
        previwe_img_id: 4
      })
    })
    .then(() => {
      db.Category.create({
        category_id: 3,
        name: 'programing',
        title: 'Программирование и IT',
        discription: 'Раздел посвященный IT технологиям и программированию',
        content: 'В более широком смысле, программирование — процесс создания программ, то есть разработка программного обеспечения. Большая часть работы программиста связана с написанием исходного кода на одном из языков программирования.',
        header_img_id: 5,
        previwe_img_id: 6
      })
    })

    // Materials sport
    .then(() => {
      db.Img.create({
        img_id: 7,
        name: 'no_hand',
        file_name: 'no_hand',
        file_path: '/static_img/materials/sport/'
      })
    })
    .then(() => {
      db.Material.create({
        material_id: 1,
        name: 'no_hand',
        title: 'Как научиться ездить на велосипеде без рук',
        discription: 'Даже в детстве я не умел кататься на велике, не держась за руль. Пробовал, конечно, и даже один раз очень неудачно упал, сильно разбив руку. Поэтому в зрелом возрасте особо не пытался — повторять...',
        content: '<p>Даже в детстве я не умел кататься на велике, не держась за руль. Пробовал, конечно, и даже один раз очень неудачно упал, сильно разбив руку. Поэтому в зрелом возрасте особо не пытался — повторять детский опыт не хотелось. Нельзя сказать, что это такое нужное упражнение, но я смотрел с некоторой долей зависти на людей, которые могли делать на ходу вещи, требующие использование двух рук.</p><p><img class="aligncenter size-full wp-image-12684" src="http://kotovski.net/wp-content/uploads/ezda_bez_ruk2.jpg" alt="" width="648" height="414" srcset="http://kotovski.net/wp-content/uploads/ezda_bez_ruk2.jpg 648w, http://kotovski.net/wp-content/uploads/ezda_bez_ruk2-300x192.jpg 300w, http://kotovski.net/wp-content/uploads/ezda_bez_ruk2-585x374.jpg 585w" sizes="(max-width: 648px) 100vw, 648px"></p><p>И вот тут, в прошлом году, я решил проанализировать, что именно мне мешает постигнуть это простое умение. Так как всё оказалось крайне просто, я расскажу, в чем главная ошибка. Чаще всего, попытка выглядит так: на небольшой скорости человек отпускает руль, велосипед начинает водить из стороны в сторону, ездок в первые моменты пытается поймать равновесие, но потом, видя, что амплитуда увеличивается, хватается за руль.</p><p>Дело в том, что учиться ездить на велосипеде без рук нужно на бОльшей скорости, когда велосипед становится устойчивым (хотя отпускать руль на скорости и страшновато поначалу). Когда умение придет, то равновесие получится удерживать и при медленной езде.</p><p>Второй (и важнейший) момент — при отпускании рук нужно сразу же отклонить корпус, поставить его вертикально, и даже чуть-чуть назад, к заднему колесу. В своих неудачных попытках я оставлял корпус нависать над рулем (чтобы успеть его перехватить), из-за этого вес оказывался смещен вперед и велосипед был неустойчивым.</p><p>Третий момент — не переставайте крутить педали в процессе обучения, постоянная тяга сделает велосипед еще более устойчивым. Таким образом, двигаясь со скоростью хотя бы 20км/ч, откинувшись назад и крутя педали, вы сможете ехать без рук.</p><p>Сначала курс будет непросто удержать, байк всё равно станет уходить с траектории с широкой амплитудой, поэтому надо научиться парировать крены движением корпуса вправо-влево. В эти моменты нужно еще сильнее откинуться назад, сидя на копчике — это разгрузит переднее колесо и велосипед легко выровняется.</p><p>Разумеется, эти упражнения нужно производить на тихой дороге, без людей и машин. Шлем в обязательном порядке, перчатки и наколенники тоже не помешают.</p><p>Вот так, премудрости, которые многие постигли интуитивно в детстве, мне приходится изучать во взрослом возрасте, через логику. Подозреваю, что среди моих читателей могут быть мастодонты вроде меня, которые уже много лет на велосипеде, но ездить, не держась за руль, не умеют. Если есть такие, пишите!</p><p>И не поленитесь репостнуть — вдруг кому пригодится, кнопочки соцсетей рядом.</p><p>PS. Вот бы еще баннихоп освоить Но это точно нереально для меня.</p>',
        img_id: 7,
        category_id: 1
      })
    })
    .then(() => {
      db.Img.create({
        img_id: 8,
        name: 'velo_razvod',
        file_name: 'velo_razvod',
        file_path: '/static_img/materials/sport/'
      })
    })
    .then(() => {
      db.Material.create({
        material_id: 2,
        name: 'velo_razvod',
        title: 'Как велосипеды до развода доводят — не повторяйте ошибки',
        discription: 'Как сообщает турецкое издание Daily Sabah, нездоровое пристрастие к велосипеду разбило ячейку общества. Жена подала на развод и требует от мужа компенсацию в 85к евро за поломанную психику. По её...',
        content: '<p>Как сообщает турецкое издание Daily Sabah, нездоровое пристрастие к велосипеду разбило ячейку общества. Жена подала на развод и требует от мужа компенсацию в 85к евро за поломанную психику. По её словам, муж постоянно занимался своим велосипедом, не обращая внимания на супругу. Женщину бесило, что каждый день он чистил, апгрейдил и ремонтировал байк прямо в гостинной комнате.</p><p>«Это не просто увлечение, он в прямом смысле влюблен в свой велосипед», — расказала расстроенная жена. Комментариев от мужа пока не поступало.</p><p>И смех, и грех, конечно. Велосипед действительно, хобби так себе для семейной жизни — во-первых, оно пожирает время. Если вы серьезно увлечены, то вечера и выходные будете проводить на колесах — в Турции можно катать круглый год, а у нас народ зимой стал пересаживаться на трейнеры с Zwift’ом. Во-вторых, хобби весьма грязное, что там ни говори, после покатушек по сырому лесу приходится тащить в квартиру полкило грязи. Смазка, апгрейды, обслуживание аммортов на дому — тоже дело нечистое.</p><p>В-третьих, велосипед не самое дешевое хобби, тем более, если вы увлеклись любительскими гонками. Семейный бюджет стонет, когда ему приходится осиливать покупку не только дорогих велосипедов, но и кучу всяких приблуд типа пауэрметров, спортивных часов и аэрошлемов. Ну и еще, представьте, как бесит вторую половину тот факт, что в вашей и так не слишком большой квартире размещаются два-три велосипеда, особенно учитывая, что у современных МТБ рули почти по метру шириной.</p><p>Можно только посочувствовать этой несчастной, муж которой проводит 15-20 часов в неделю на колесах, потом обслуживает и чистит вел, а в свободное от этого время постит в инстаграме скриншоты из Стравы о взятии очередного KOM’a, отвечая на комменты единомышленников. Неудивительно, что она чувствует себя лишней на этом празднике жизни.</p><p>Так что, друзья велосипедисты, кто еще не женат — не женитесь, пока не подыщете себе хобби попроще и подомашнее, а те, кто уже влип — думайте хоть иногда о ближних. Всем добра и скорого наступления нового велосезона!</p>',
        img_id: 8,
        category_id: 1
      })
    })
    .then(() => {
      db.Img.create({
        img_id: 9,
        name: 'velo_itogi_2017',
        file_name: 'velo_itogi_2017',
        file_path: '/static_img/materials/sport/'
      })
    })
    .then(() => {
      db.Material.create({
        material_id: 3,
        name: 'velo_itgi_2017',
        title: 'Подведем вело-итоги за 2017 год',
        discription: 'Этот год в велосипедном смысле выдался для меня крайне продуктивным, так что я даже решил запилить небольшую заметку. Во-первых, купил новый велосипед, чего уже давно не делал. BH Fusion 105 —...',
        content: '<p>Этот год в велосипедном смысле выдался для меня крайне продуктивным, так что я даже решил запилить небольшую заметку. Во-первых, купил новый велосипед, чего уже давно не делал. BH Fusion 105 — карбоновый шоссер-эндуранс, <a href="http://kotovski.net/novyiy-velosiped-kotovskogo/">я писал о нем здесь</a>. Неплохо откатал на нём это лето, но пришло осознание, что я хочу сменить ориентацию и после долгого перерыва снова сесть на MTB.</p><p><img class="aligncenter size-full wp-image-12626" src="http://kotovski.net/wp-content/uploads/new_bike_1.jpg" alt="" width="450" height="600" srcset="http://kotovski.net/wp-content/uploads/new_bike_1.jpg 450w, http://kotovski.net/wp-content/uploads/new_bike_1-225x300.jpg 225w" sizes="(max-width: 450px) 100vw, 450px"></p><p>Во-вторых, общий годовой вело-пробег неожиданно удивил даже меня: более 14000 км. Признаюсь, даже в самые лучшие годы, когда энтузиазм и здоровье были безграничными, не удавалось столько накатать. Помню, что в самый первый велосезон с лета 2006 по осень 2007 я накрутил что-то около 11 или 12 тысяч км. Причем это включая всякие велопоходы, ПВД и марафоны.&nbsp;А тут чисто покатушки «вокруг дома», и 14 тысяч:</p><p><img class="aligncenter size-full wp-image-12627" src="http://kotovski.net/wp-content/uploads/annual_cycling.jpg" alt="" width="415" height="500" srcset="http://kotovski.net/wp-content/uploads/annual_cycling.jpg 415w, http://kotovski.net/wp-content/uploads/annual_cycling-249x300.jpg 249w" sizes="(max-width: 415px) 100vw, 415px">Секрет в постоянстве — утром выкатываешься на пару часиков и потом уже вечером, как получится. И так каждый день, стараясь не пропускать. Мне это сложнее всего — лень такая штука, что не дает делать даже то, что приносит удовольствие. Но всё-таки вытащишь себя силой на улицу, а потом наслаждаешься процессом.</p><p>В-третьих, в первый раз за всю мою велоисторию удалось катать целый месяц ежедневно, без одного пропуска. Очень полезно для самодисциплины и борьбы с ленью.</p><p><img class="aligncenter size-full wp-image-12628" src="http://kotovski.net/wp-content/uploads/november_cycling.jpg" alt="" width="900" height="360" srcset="http://kotovski.net/wp-content/uploads/november_cycling.jpg 900w, http://kotovski.net/wp-content/uploads/november_cycling-300x120.jpg 300w, http://kotovski.net/wp-content/uploads/november_cycling-768x307.jpg 768w, http://kotovski.net/wp-content/uploads/november_cycling-585x234.jpg 585w" sizes="(max-width: 900px) 100vw, 900px"></p><p>Из минусов отмечу то, что не удалось реализовать ни одну из фантазий, которые зрели в голове с прошлой зимы. Я думал о разном: хотелось прокатиться на велосипеде по северу Шотландии и заехать к друзьям, с которыми жил вместе, много лет назад. Хотел сесть в автобус со складником и устроить турне по городам Европы. Думал о посещении Украины или Белорусии. Даже были мысли о прохождении пути Камино в вело формате. Но ничего не сделал, причем по совершенно необъективным причинам — видимо, не было настоящего желания.</p><p>Также неприятны несколько десятков проколов, которые выводили меня из себя. Основной годовой пробег пришелся на Таиланд, а здесь на обочинах дорог просто скопище битого стекла, проволоки, гвоздей и прочего мусора. Однажды меня это так выбесило, что со злости доехал на пустом колесе до дома 10 км. Покрышка и камера в утиль, обод в порядке.</p><p><img class="aligncenter size-full wp-image-12629" src="http://kotovski.net/wp-content/uploads/tire_puncture_1.jpg" alt="" width="450" height="600" srcset="http://kotovski.net/wp-content/uploads/tire_puncture_1.jpg 450w, http://kotovski.net/wp-content/uploads/tire_puncture_1-225x300.jpg 225w" sizes="(max-width: 450px) 100vw, 450px"></p><p>В целом, ощущения от вело-движения замечательные, прослушана масса аудиокниг, а последнее время пристрастился смотреть сериалы, поставив смартфон в держатель на руль и наматывая круги по стадиону. Отлично заходит — пара эпизодов перед сном.</p><p>Насчет планов на лето ничего говорить не буду, опять имеются смутные фантазии — если получится что-то реализовать, то расскажу. </p><p>О текущих радостях и гадостях я пишу в основном на своей <a href="https://www.facebook.com/viktorkotovski">странице в Фейсбук</a>, кому интересно — подписывайтесь или добавляйтесь в друзья.</p><p>Делитесь в комментариях, как прошел ваш вело 2017 год.</p>',
        img_id: 9,
        category_id: 1
      })
    })

    // Material travel
    .then(() => {
      db.Img.create({
        img_id: 10,
        name: 'krugosvet',
        file_name: 'krugosvet',
        file_path: '/static_img/materials/travel/'
      })
    })
    .then(() => {
      db.Material.create({
        material_id: 4,
        name: 'krugosvet',
        title: 'Кругосветное велопутешествие Егора Ковальчука: 53772 км на двух колесах',
        discription: 'Недавно мне пришло письмо от путешественника Егора Ковальчука, который попросил разместить его рассказ о двухгодичном кругосветном велопоходе. Я остался под большим впечатлением от...',
        content: '<h2>«По Миру на Велосипеде, и Вокруг»</h2><p>Название носит большой смысл в «по Миру», вложена вся идея о Путешествии как о Странствии, Поиске, Общении. Здесь главное — это Люди, главное — это Человек. В «..и Вокруг» — это основа как раз спортивной и географической концепции.</p><p>За более, чем два года, я не посетил Африку, Южную Америку, Австралию и Антарктиду, но в данной концепции и не ставил таких задач.</p><p>В Международной аттестации, о кругосветном путешествии на велосипеде внесены различные правила: посещение всех материков, наличие антипод-точек, длинна маршрута должна быть более длинны экватора(40.000км), маршрут должен быть во всех полушариях. Эти правила противоречат маршрутам первых кругосветчиков на велосипеде 100-летней давности. Для меня в данном путешествии со спортивной точки зрения было важным соблюдение длинны маршрута и совершение «круга» по географической горизонтали-широте.</p><p>Говорят, что сперва делается «круг», а после уже всю жизнь его можно дополнять. Это к слову о формальности посещения всех континентов. Мне не хотелось претендовать на оригинальность, я просто выполнял свой авторский маршрут, который так же выражен своей индивидуальностью и почерком. Посещение других континентов будет осуществлено в будущем, если то будет угодным.</p>',
        img_id: 10,
        category_id: 2
      })
    })
    .then(() => {
      db.Img.create({
        img_id: 11,
        name: 'tailand',
        file_name: 'tailand',
        file_path: '/static_img/materials/travel/'
      })
    })
    .then(() => {
      db.Material.create({
        material_id: 5,
        name: 'tailand',
        title: 'Итоги зимовки в Таиланде',
        discription: 'В прошлом сентябре я писал заметку о том, что решил больше не насиловать психику унылой эстонской зимой, и отбыл с семьей в Таиланд на зимовку. Вчера, после восьми месяцев жизни на тропическом...',
        content: '<p>В прошлом сентябре я <a href="http://kotovski.net/dolgiy-put-k-letu-ili-o-vrede-ekonomii/">писал заметку о том</a>, что решил больше не насиловать психику унылой эстонской зимой, и отбыл с семьей в Таиланд на зимовку.</p><p>Вчера, после восьми месяцев жизни на тропическом острове, мы вернулись в родные широты. Впечатления как бы это помягче выразиться — пронзительные. </p><p>Веселый пилот Аэрофлота перед заходом на посадку радостно объявил: «В Таллине хорошая погода, +6 градусов». Мы с Мурзиком переглянулись — у нас несколько другие представления о хорошей погоде  Утром мы вылетали с острова Самуи, где уже в 5 утра было +28.</p><p>Когда я планировал возвращение, то почему-то посчитал, что конец апреля обязательно должен быть уже достаточно теплым, чтобы у нас не случилось культурного шока. Наверно забыл, как в прошлом июне было днем +12 с северным ветром. +12, блин, в июне!</p><p>Слышали такой термин — «климатический иммигрант»? Это человек, для которого основной причиной покинуть свою страну является плохой климат. Проведя в первый раз так много времени в теплой стране, могу с уверенностью сказать — это про меня. </p>',
        img_id: 11,
        category_id: 2
      })
    })
    .then(() => {
      db.Img.create({
        img_id: 12,
        name: 'mesta_rossii',
        file_name: 'mesta_rossii',
        file_path: '/static_img/materials/travel/'
      })
    })
    .then(() => {
      db.Material.create({
        material_id: 6,
        name: 'mesta_rossii',
        title: 'Неожиданные места России',
        discription: 'Читатель поделился интересной ссылкой — в мире есть всякие раскрученные туристические места, узнаваемость которых гарантирована. Как выяснилось, некоторые из этих мест можно посетить, не...',
        content: '<p>Наверняка, подобных объектов гораздо больше, жаль, что у нас так не развита туристическая инфраструктура. Ведь та же Европа чем берет — у них чуть ли ни около каждого водопада есть несколько гостиниц и кемпингов, для туристов с разным достатком.</p><p>Причем, природные достопримечательности активно рекламируются, маркируются трейлы в заповедниках, чтобы даже простые люди могли легко найти все красоты. Вся информация легко доступна, общественный транспорт проложен таким образом, чтобы и те, кто не имеет машины, смогли добраться.</p><p>Большая ошибка думать, что туризм в Европе ограничивается затертыми достопримечательностями в столицах, наоборот, у меня сложилось впечатление, что больше людей приезжают к природным красотам.</p><p>В результате, страны привлекают много туристов, как из заграницы, так и своих граждан. Оживают отдаленные области, строятся новые дороги, гостиницы. Экология не страдает, потому что всё сделано для того, чтобы вписать туристическую инфраструктуру в окружающую среду.</p>',
        img_id: 12,
        category_id: 2
      })
    })

    // Materials pograming
    .then(() => {
      db.Img.create({
        img_id: 13,
        name: 'MPI_tech',
        file_name: 'MPI_tech.png',
        file_path: '/static_img/materials/programing/'
      })
    })
    .then(() => {
      db.Material.create({
        material_id: 7,
        name: 'MPI_tech',
        title: 'Основы технологии MPI на примерах',
        discription: 'Параллельное программирование — очень актуальное направление, т.к. большинство современных вычислительных устройств (включая телефоны) являются многоядерными или многопроцессорными. В предыдущей записи я публиковал учебник по OpenMP, однако OpenMP позволяет программировать только системы с общей памятью — в большей части, многоядерные компьютеры. Основной проблемой таких систем является плохая масштабируемость — не так',
        content: '<p>Параллельное программирование — очень актуальное направление, т.к. большинство современных вычислительных устройств (включая телефоны) являются многоядерными или многопроцессорными. В предыдущей записи я публиковал <a href="https://pro-prof.com/archives/4335">учебник по OpenMP</a>, однако OpenMP позволяет программировать только системы с общей памятью — в большей части, многоядерные компьютеры. Основной проблемой таких систем является плохая масштабируемость — не так легко и дешево увеличить число ядер в компьютере.</p><p>Другой класс параллельных ЭВМ — системы с распределенной памятью, к которым, в частности, относятся кластеры. Они представляют собой набор соединенных сетью компьютеров. Такая система гораздо лучше мастабируется — не составит особого труда купить и подключить в сеть дополнительную сотню компьютеров. Число вычислительных узлов в кластерах измеряется тысячами.</p><h2>Ключевые особенности MPI</h2><p>Допустим, есть у нас кластер. Чтобы программа начала на нем выполняться, ее необходимо <strong>скопировать</strong> на каждый узел, <strong>запустить</strong> и <strong>установить связь</strong> между процессами. Эту работу берет на себя утилита <em>mpirun</em> (под Linux) или <em>mpiexec</em> (под Windows), так например, чтобы запустить 5 процессов достаточно написать:</p>',
        img_id: 13,
        category_id: 3
      })
    })
    .then(() => {
      db.Img.create({
        img_id: 14,
        name: 'openMP_book',
        file_name: 'openMP_book.png',
        file_path: '/static_img/materials/programing/'
      })
    })
    .then(() => {
      db.Material.create({
        material_id: 8,
        name: 'openMP_book',
        title: 'Учебник по OpenMP',
        discription: 'OpenMP — это библиотека для параллельного программирования вычислительных систем с общей памятью (дальше кратко описано что это за системы). Официально поддерживается Си, С++ и Фортран, однако можно найти реализации для некоторых других языков, например Паскаль [1] и Java [2]. Все примеры в этом «учебнике» написаны на С++. Библиотека активно развивается,',
        content: '<p>OpenMP — это библиотека для параллельного программирования вычислительных систем с общей памятью (дальше кратко описано что это за системы). Официально поддерживается Си, С++ и Фортран, однако можно найти реализации для некоторых других языков, например Паскаль [1] и Java [2]. Все примеры в этом «учебнике» написаны на С++.</p><p>Библиотека активно развивается, в настоящий момент актуальный стандарт версии 4.5 (выпущен в 2015 году), однако уже идет разработка версии 5.0. В тоже время, компилятор Microsoft C++ поддерживает только версию 2.0, а gcc — версию 4.0.</p><p>Библиотека OpenMP часто используется в математических вычислениях, т.к. позволяет очень быстро и без особого труда распараллелить вашу программу. При этом, идеология OpenMP не очень хорошо подойдет, скажем, при разработке серверного ПО (для этого существуют более подходящие инструменты).</p><p>Этой библиотеке посвящено множество книг и статей. Наиболее популярными являются книги Антонова [3] и Гергеля [4], мной также был написан ряд статей (поверхностных) по этой теме [5,6], и ряд примеров программ на нашем форуме [7]. На мой взгляд, у этих книг есть ряд недостатков (которые я, конечно, исправляю):</p>',
        img_id: 14,
        category_id: 3
      })
    })
    .then(() => {
      db.Img.create({
        img_id: 15,
        name: 'analise_alg',
        file_name: 'analise_alg.png',
        file_path: '/static_img/materials/programing/'
      })
    })
    .then(() => {
      db.Material.create({
        material_id: 9,
        name: 'analise_alg',
        title: 'Примеры анализа сложности алгоритмов',
        discription: 'Еще одна статья по анализу алгоритмов? Давным давно я написал статью, в которой была параллельная реализация алгоритма быстрой сортировки [1]. По ней я получил обратную связь. Одни ребята написали мне, что быстрая сортировка будет работать медленнее, чем их реализация (мне скинули «слегка оптимизированный» алгоритм сортировки пузырьком). В качестве аргумента я',
        content: '<h2>Еще одна статья по анализу алгоритмов?</h2><p>Давным давно я написал статью, в которой была <a href="https://pro-prof.com/archives/1220" rel="noopener" target="_blank">параллельная реализация алгоритма быстрой сортировки</a> [1]. По ней я получил обратную связь. Одни ребята написали мне, что быстрая сортировка будет работать медленнее, чем их реализация (мне скинули «слегка оптимизированный» алгоритм сортировки пузырьком). В качестве аргумента я получил такую фразу: </p><blockquote><p>«он (алгоритм быстрой сортировки) <strong>очевидно</strong> медленнее (‘посмотри сколько там кода вообще?’). Чем больше кода — тем медленнее работает, ведь код процессор должен выполнить».</p></blockquote>',
        img_id: 15,
        category_id: 3
      })
    })

    // Banners
    .then(() => {
      db.Img.create({
        img_id: 16,
        name: 'example',
        file_name: 'example.png',
        file_path: '/static_img/banners/'
      })
    })
    .then(() => {
      db.Banner.create({
        id: 1,
        slot: 1,
        url: 'http://snowboards.com',
        text: 'Купить новый отличный сноуборд!',
        img_id: 16
      })
    })
    .then(() => {
      db.Banner.create({
        id: 2,
        slot: 1,
        url: 'http://velo.ru',
        text: 'Распродажа велосипедов',
        img_id: 16
      })
    })
    .then(() => {
      db.Banner.create({
        id: 3,
        slot: 1,
        url: 'http://putevka.ru',
        text: 'Горячие туры',
        img_id: 16
      })
    })
    .then(() => {
      db.Banner.create({
        id: 4,
        slot: 1,
        url: 'http://tickets.ru',
        text: 'Дешевые билеты',
        img_id: 16
      })
    })
    .then(() => {
      db.Banner.create({
        id: 5,
        slot: 1,
        url: 'http://academy.ru',
        text: 'Курсы для программистов',
        img_id: 16
      })
    })
    .then(() => {
      db.Banner.create({
        id: 6,
        slot: 1,
        url: 'http://it-books.ru',
        text: 'Лучшие книги по IT',
        img_id: 16
      })
    })
    .then(() => {
      db.Banner.create({
        id: 7,
        slot: 1,
        url: 'http://spring2017.ru',
        text: 'Специальное ИТОГОВОЕ предложение',
        img_id: 16
      })
    })

    // Infos
    .then(() => {
      db.Info.create({
        id: 1,
        slot: 1,
        text: 'Специальная информация для путешественников'
      })
    })
    .then(() => {
      db.Info.create({
        id: 2,
        slot: 1,
        text: 'Дополнительная заметка про итоги года'
      })
    })

    // Widgets
    .then(() => {
      db.Widget.create({
        widget_id: 1,
        page_table: 'category',
        page_id: 1,
        widget_table: 'banner',
        concrete_widget_id: 1
      })
    })
    .then(() => {
      db.Widget.create({
        widget_id: 2,
        page_table: 'category',
        page_id: 1,
        widget_table: 'banner',
        concrete_widget_id: 2
      })
    })
    .then(() => {
      db.Widget.create({
        widget_id: 3,
        page_table: 'category',
        page_id: 2,
        widget_table: 'banner',
        concrete_widget_id: 3
      })
    })
    .then(() => {
      db.Widget.create({
        widget_id: 4,
        page_table: 'category',
        page_id: 2,
        widget_table: 'banner',
        concrete_widget_id: 4
      })
    })
    .then(() => {
      db.Widget.create({
        widget_id: 5,
        page_table: 'category',
        page_id: 3,
        widget_table: 'banner',
        concrete_widget_id: 5
      })
    })
    .then(() => {
      db.Widget.create({
        widget_id: 6,
        page_table: 'category',
        page_id: 3,
        widget_table: 'banner',
        concrete_widget_id: 6
      })
    })
    .then(() => {
      db.Widget.create({
        widget_id: 7,
        page_table: 'category',
        page_id: 2,
        widget_table: 'info',
        concrete_widget_id: 1
      })
    })
    .then(() => {
      db.Widget.create({
        widget_id: 8,
        page_table: 'material',
        page_id: 3,
        widget_table: 'info',
        concrete_widget_id: 2
      })
    })
    .then(() => {
      db.Widget.create({
        widget_id: 9,
        page_table: 'material',
        page_id: 3,
        widget_table: 'banner',
        concrete_widget_id: 7
      })
    })
}
